module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة في ملفات الأوامر
	onlyadminbox: {
		description: "تشغيل/إيقاف وضع يسمح فقط للمشرف باستخدام البوت",
		guide: "   {pn} [تشغيل | إيقاف]",
		text: {
			turnedOn: "تم تشغيل الوضع بحيث يمكن فقط لمشرف المجموعة استخدام البوت",
			turnedOff: "تم إيقاف الوضع بحيث يمكن فقط لمشرف المجموعة استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم فقط {pn} تشغيل أو {pn} إيقاف"
		}
	},
	adduser: {
		description: "إضافة مستخدم إلى دردشة المجموعات الخاصة بك",
		guide: "   {pn} [رابط الملف الشخصي | uid]",
		text: {
			alreadyInGroup: "موجود بالفعل في المجموعة",
			successAdd: "- تم إضافة %1 أعضاء بنجاح إلى المجموعة",
			failedAdd: "- فشل في إضافة %1 أعضاء إلى المجموعة",
			approve: "- تم إضافة %1 أعضاء إلى قائمة الموافقة",
			invalidLink: "يرجى إدخال رابط فيسبوك صالح",
			cannotGetUid: "لا يمكن الحصول على uid لهذا المستخدم",
			linkNotExist: "رابط الملف الشخصي هذا غير موجود",
			cannotAddUser: "تم حظر البوت أو قام هذا المستخدم بحظر الغرباء من الإضافة إلى المجموعة"
		}
	},
	admin: {
		description: "إضافة، إزالة، تعديل دور المشرف",
		guide: "   {pn} [إضافة | -a] <uid>: إضافة دور مشرف للمستخدم\n\t  {pn} [إزالة | -r] <uid>: إزالة دور المشرف للمستخدم\n\t  {pn} [قائمة | -l]: عرض جميع المشرفين",
		text: {
			added: "✅ | تم إضافة دور المشرف لـ %1 مستخدمين:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدمين لديهم بالفعل دور المشرف:\n%2",
			missingIdAdd: "⚠️ | يرجى إدخال ID أو الإشارة إلى المستخدم لإضافة دور المشرف",
			removed: "✅ | تم إزالة دور المشرف لـ %1 مستخدمين:\n%2",
			notAdmin: "⚠️ | %1 مستخدمين ليس لديهم دور مشرف:\n%2",
			missingIdRemove: "⚠️ | يرجى إدخال ID أو الإشارة إلى المستخدم لإزالة دور المشرف",
			listAdmin: "👑 | قائمة المشرفين:\n%1"
		}
	},
	adminonly: {
		description: "تشغيل/إيقاف وضع يسمح فقط للمشرف باستخدام البوت",
		guide: "{pn} [تشغيل | إيقاف]",
		text: {
			turnedOn: "تم تشغيل الوضع بحيث يمكن فقط للمشرف استخدام البوت",
			turnedOff: "تم إيقاف الوضع بحيث يمكن فقط للمشرف استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم فقط {pn} تشغيل أو {pn} إيقاف"
		}
	},
	all: {
		description: "الإشارة إلى جميع الأعضاء في دردشة المجموعة",
		guide: "{pn} [المحتوى | فارغ]"
	},
	anime: {
		description: "صورة أنمي عشوائية",
		guide: "{pn} <endpoint>\n   قائمة النهايات: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جارٍ تهيئة الصورة، يرجى الانتظار...",
			error: "حدث خطأ، يرجى المحاولة لاحقًا"
		}
	},
	antichangeinfobox: {
		description: "تشغيل/إيقاف منع تغيير معلومات الدردشة",
		guide: "   {pn} avt [تشغيل | إيقاف]: منع تغيير صورة الدردشة\n   {pn} name [تشغيل | إيقاف]: منع تغيير اسم الدردشة\n   {pn} theme [تشغيل | إيقاف]: منع تغيير الثيم للدردشة\n   {pn} emoji [تشغيل | إيقاف]: منع تغيير الإيموجي للدردشة",
		text: {
			antiChangeAvatarOn: "تم تشغيل منع تغيير صورة الدردشة",
			antiChangeAvatarOff: "تم إيقاف منع تغيير صورة الدردشة",
			missingAvt: "لم تقم بتعيين صورة للدردشة",
			antiChangeNameOn: "تم تشغيل منع تغيير اسم الدردشة",
			antiChangeNameOff: "تم إيقاف منع تغيير اسم الدردشة",
			antiChangeThemeOn: "تم تشغيل منع تغيير ثيم الدردشة",
			antiChangeThemeOff: "تم إيقاف منع تغيير ثيم الدردشة",
			antiChangeEmojiOn: "تم تشغيل منع تغيير إيموجي الدردشة",
			antiChangeEmojiOff: "تم إيقاف منع تغيير إيموجي الدردشة",
			antiChangeAvatarAlreadyOn: "دردشة مجموعتك حالياً على منع تغيير الصورة",
			antiChangeNameAlreadyOn: "دردشة مجموعتك حالياً على منع تغيير الاسم",
			antiChangeThemeAlreadyOn: "دردشة مجموعتك حالياً على منع تغيير الثيم",
			antiChangeEmojiAlreadyOn: "دردشة مجموعتك حالياً على منع تغيير الإيموجي"
		}
	},
	appstore: {
		description: "البحث عن تطبيق في متجر التطبيقات",
		text: {
			missingKeyword: "لم تدخل أي كلمة مفتاحية",
			noResult: "لم يتم العثور على نتائج للكلمة المفتاحية %1"
		}
	},
	autosetname: {
		description: "تغيير الاسم تلقائياً للأعضاء الجدد",
		guide: "   {pn} set <nickname>: لتعيين إعداد تغيير الاسم تلقائيًا، مع بعض الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: ID العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [تشغيل | إيقاف]: لتشغيل/إيقاف هذه الخاصية\n\n   {pn} [عرض | info]: عرض الإعداد الحالي",
		text: {
			missingConfig: "يرجى إدخال الإعداد المطلوب",
			configSuccess: "تم تعيين الإعداد بنجاح",
			currentConfig: "الإعداد الحالي لتغيير الاسم تلقائياً في مجموعتك:\n%1",
			notSetConfig: "لم يتم تعيين إعداد تغيير الاسم تلقائياً لمجموعتك",
			syntaxError: "خطأ في الصياغة، استخدم فقط \"{pn} تشغيل\" أو \"{pn} إيقاف\"",
			turnOnSuccess: "تم تشغيل ميزة تغيير الاسم تلقائياً",
			turnOffSuccess: "تم إيقاف ميزة تغيير الاسم تلقائياً",
			error: "حدث خطأ أثناء استخدام ميزة تغيير الاسم تلقائياً، حاول إيقاف ميزة رابط الدعوة في المجموعة وأعد المحاولة لاحقًا"
		}
	},
	avatar: {
		description: "إنشاء صورة رمزية أنمي مع توقيع",
		guide: "{p}{n} <معرف الشخصية أو اسمها> | <نص الخلفية> | <التوقيع> | <لون الخلفية أو رمز اللون>\n{p}{n} help: عرض كيفية استخدام الأمر",
		text: {
			initImage: "جارٍ تهيئة الصورة، يرجى الانتظار...",
			invalidCharacter: "حاليًا يوجد فقط %1 شخصيات في النظام، يرجى إدخال معرف شخصية أقل",
			notFoundCharacter: "لم يتم العثور على شخصية باسم %1",
			errorGetCharacter: "حدث خطأ أثناء جلب بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الرمزية\nالشخصية: %1\nID: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "الافتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تشغيل/إيقاف/إضافة/حذف كلمات محظورة، إذا خالف العضو سيُحذر، وإذا كرر سيتم طرده من المجموعة",
		guide: "   {pn} add <كلمات>: إضافة كلمات محظورة (يمكن إضافة عدة كلمات مفصولة بفواصل \",\" أو |)\n   {pn} delete <كلمات>: حذف كلمات محظورة\n   {pn} list <إخفاء | ترك فارغ>: إيقاف التحذير (أضف \"إخفاء\" لإخفاء الكلمات المحظورة)\n   {pn} unwarn [<userID> | <@tag>]: إزالة تحذير واحد عن عضو\n   {pn} on: تشغيل التحذير\n   {pn} off: إيقاف التحذير",
		text: {
			onText: "تشغيل",
			offText: "إيقاف",
			onlyAdmin: "⚠️ | فقط المشرفين يمكنهم إضافة كلمات محظورة للقائمة",
			missingWords: "⚠️ | لم تدخل الكلمات المحظورة",
			addedSuccess: "✅ | تم إضافة %1 كلمات محظورة للقائمة",
			alreadyExist: "❌ | %1 كلمات محظورة موجودة مسبقًا: %2",
			tooShort: "⚠️ | %1 كلمات محظورة لا يمكن إضافتها لأنها أقل من حرفين: %2",
			onlyAdmin2: "⚠️ | فقط المشرفين يمكنهم حذف الكلمات المحظورة من القائمة",
			missingWords2: "⚠️ | لم تدخل الكلمات للحذف",
			deletedSuccess: "✅ | تم حذف %1 كلمات محظورة من القائمة",
			notExist: "❌ | %1 كلمات محظورة غير موجودة في القائمة مسبقًا: %2",
			emptyList: "⚠️ | قائمة الكلمات المحظورة في مجموعتك فارغة حاليًا",
			badWordsList: "📑 | قائمة الكلمات المحظورة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | فقط المشرفين يمكنهم %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم %1 تحذير الكلمات المحظورة",
			onlyAdmin4: "⚠️ | فقط المشرفين يمكنهم حذف تحذير الكلمات المحظورة",
			missingTarget: "⚠️ | لم تدخل ID المستخدم أو أشرت إليه",
			notWarned: "⚠️ | المستخدم %1 لم يتم تحذيره من الكلمات المحظورة",
			removedWarn: "✅ | تمت إزالة تحذير كلمة محظورة واحدة للمستخدم %1 | %2",
			warned: "⚠️ | تم الكشف عن كلمات محظورة \"%1\" في رسالتك، إذا استمريت في المخالفة سيتم طردك من المجموعة.",
			warned2: "⚠️ | تم الكشف عن كلمات محظورة \"%1\" في رسالتك، لقد خالفت مرتين وسيتم طردك من المجموعة.",
			needAdmin: "البوت يحتاج إلى صلاحيات المشرف لطرد الأعضاء المخالفين",
			unwarned: "✅ | تمت إزالة تحذير كلمات محظورة للمستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض رصيدك أو رصيد الشخص المشار إليه",
		guide: "   {pn}: عرض رصيدك\n   {pn} <@tag>: عرض رصيد الشخص المشار إليه",
		text: {
			money: "لديك %1$",
			moneyOf: "%1 لديه %2$"
		}
	},
	batslap: {
		description: "صورة صفعة بالمضرب",
		text: {
			noTag: "يجب الإشارة إلى الشخص الذي تريد صفعه"
		}
	},
	busy: {
		description: "تشغيل وضع عدم الإزعاج، عند الإشارة إليك سيقوم البوت بالإخطار",
		guide: "   {pn} [فارغ | <السبب>]: تشغيل وضع عدم الإزعاج\n   {pn} إيقاف: إيقاف وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج",
			turnedOn: "✅ | تم تشغيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تشغيل وضع عدم الإزعاج مع السبب: %1",
			alreadyOn: "المستخدم %1 مشغول حاليًا",
			alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بسبب: %2"
		}
	},
	callad: {
		description: "إرسال تقرير، ملاحظات، أخطاء... إلى مشرف البوت",
		guide: "   {pn} <الرسالة>",
		text: {
			missingMessage: "يرجى إدخال الرسالة التي تريد إرسالها إلى المشرف",
			sendByGroup: "\n- تم الإرسال من المجموعة: %1\n- معرف الدردشة: %2",
			sendByUser: "\n- تم الإرسال من المستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
			success: "تم إرسال رسالتك إلى المشرف بنجاح!",
			reply: "📍 رد من المشرف %1:\n─────────────────\n%2\n─────────────────\nرد على هذه الرسالة للاستمرار في إرسال رسالة للمشرف",
			replySuccess: "تم إرسال ردك للمشرف بنجاح!",
			feedback: "📝 ملاحظات من المستخدم %1:\n- معرف المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nرد على هذه الرسالة لإرسال رسالة إلى المستخدم",
			replyUserSuccess: "تم إرسال ردك للمستخدم بنجاح!"
		}
	},
	// باقي الأقسام يمكن ترجمتها بنفس النمط...
};
