module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرة في ملفات الأوامر
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "تم تحذير العضو %1 ثلاث مرات مسبقاً وتم حظره من صندوق المحادثة\n- الاسم: %1\n- معرف المستخدم: %2\n- لإلغاء الحظر، يرجى استخدام الأمر \"%3warn unban <uid>\" (حيث يكون uid هو معرف المستخدم الذي تريد رفع الحظر عنه)",
			needPermission: "يحتاج البوت إلى صلاحيات المسؤول لطرد الأعضاء المحظورين"
		}
	},
	leave: {
		text: {
			session1: "صباحاً",
			session2: "ظهراً",
			session3: "بعد الظهر",
			session4: "مساءً",
			leaveType1: "غادر المجموعة",
			leaveType2: "تم طرده من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجلات البوت ======",
			added: "\n✅\nالحدث: تم إضافة البوت إلى مجموعة جديدة\n- أضيف بواسطة: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت\n- تم الطرد بواسطة: %1",
			footer: "\n- معرف المستخدم: %1\n- المجموعة: %2\n- معرف المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "صباحاً",
			session2: "ظهراً",
			session3: "بعد الظهر",
			session4: "مساءً",
			welcomeMessage: "شكراً لدعوتي إلى المجموعة!\nبادئة البوت: %1\nلعرض قائمة الأوامر، يرجى إدخال: %1help",
			multiple1: "أنت",
			multiple2: "أنتم"
		}
	}
};
